#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#include "../headers/IFDEF_FLAGS.h"
#include "../headers/MOVE_TYPE.h"
#include "../headers/MOVE_TARGET.h"
#include "../headers/SPLIT.h"
#include "../headers/FLAGS.h"
#include "../headers/MAX_EFFECT.h"
#include "../headers/EFFECTS.h"
#include "../headers/MOVES_MAPPINGS.h"
#include "../headers/POKEMON_MAPPINGS.h"
#include "../headers/BODY_COLORS.h"
#include "../headers/EGG_GROUPS.h"
#include "../headers/GROWTH_RATES.h"
#include "../headers/GENDER.h"
#include "../headers/ABILITIES.h"
#include "../headers/ITEMS.h"

#define TRUE 1

// Maximum value for a female Pokemon is 254 (MON_FEMALE) which is 100% female.
// 255 (MON_GENDERLESS) is reserved for genderless Pokemon.
#define min(a, b) (((a) < (b)) ? (a) : (b))
#define PERCENT_FEMALE(percent) min(254, ((percent * 255) / 100))

struct BaseStats
{
	/* 0x00 */ int baseHP;
	/* 0x01 */ int baseAttack;
	/* 0x02 */ int baseDefense;
	/* 0x03 */ int baseSpeed;
	/* 0x04 */ int baseSpAttack;
	/* 0x05 */ int baseSpDefense;
	/* 0x06 */ char *type1;
	/* 0x07 */ char *type2;
	/* 0x08 */ int catchRate;
	/* 0x09 */ int expYield;
	/* 0x0A */ int evYield_HP;
	/* 0x0A */ int evYield_Attack;
	/* 0x0A */ int evYield_Defense;
	/* 0x0A */ int evYield_Speed;
	/* 0x0B */ int evYield_SpAttack;
	/* 0x0B */ int evYield_SpDefense;
	/* 0x0C */ char *item1;
	/* 0x0E */ char *item2;
	/* 0x10 */ int genderRatio;
	/* 0x11 */ int eggCycles;
	/* 0x12 */ int friendship;
	/* 0x13 */ char *growthRate;
	/* 0x14 */ char *eggGroup1;
	/* 0x15 */ char *eggGroup2;
	/* 0x16 */ char *ability1;
	/* 0x17 */ char *ability2;
	/* 0x18 */ int safariZoneFleeRate;
	//  /* 0x19 */ u8 bodyColor : 7;
	int noFlip;
	/* 0x1A */ char *hiddenAbility;
};

#pragma region base stats
const struct BaseStats gBaseStats[] =
	{
		[SPECIES_NONE] = {0},

		[SPECIES_BULBASAUR] =
			{
				.baseHP = 45,
				.baseAttack = 49,
				.baseDefense = 49,
				.baseSpAttack = 65,
				.baseSpDefense = 65,
				.baseSpeed = 45,
				.type1 = TYPE_GRASS,
				.type2 = TYPE_POISON,
				.catchRate = 45,
				.expYield = 64,
				.evYield_HP = 0,
				.evYield_Attack = 0,
				.evYield_Defense = 0,
				.evYield_SpAttack = 1,
				.evYield_SpDefense = 0,
				.evYield_Speed = 0,
				.item1 = ITEM_NONE,
				.item2 = ITEM_NONE,
				.genderRatio = PERCENT_FEMALE(12.5),
				.eggCycles = 20,
				.friendship = 50,
				.growthRate = GROWTH_MEDIUM_SLOW,
				.eggGroup1 = EGG_GROUP_MONSTER,
				.eggGroup2 = EGG_GROUP_GRASS,
				.ability1 = ABILITY_OVERGROW,
				.ability2 = ABILITY_NONE,
				.safariZoneFleeRate = 0,
				.hiddenAbility = ABILITY_CHLOROPHYLL,
				.noFlip = TRUE,
			},

		[SPECIES_IVYSAUR] =
			{
				.baseHP = 60,
